BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446usart.c
}
void STM32446Uart4Parameter( uint8_t wordlength, uint8_t samplingmode, double stopbits, uint32_t baudrate )
// Sets the uart parameters, using real values.
{
	uint8_t sampling;
	double value, fracpart, intpart;
	if(wordlength == 9)
		UART4->CR1 |= (1 << 12); // M: Word length, 1 - 9bit.
	else if(wordlength == 8)
		UART4->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit.
	else
		UART4->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit, default.
	if(samplingmode == 8){
		sampling = 8;
		UART4->CR1 |= (1 << 15); // OVER8: Oversampling mode, 1 - 8.
	}else if(samplingmode == 16){
		sampling = 16;
		UART4->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16.
	}else{
		sampling = 16;
		UART4->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16, default.
	}
	UART4->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12)); // STOP: STOP bits 00 - 1stopbit, default.
	if(fabs(stopbits - 0.5) < 0.00001) // STOP: STOP bits, 01: 0.5 Stop bit
		UART4->CR2 |= (1 << 12);
	else if(fabs(stopbits - 1) < 0.00001) // STOP: STOP bits, 00: 1 Stop bit.
		UART4->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 1.5) < 0.00001) // STOP: STOP bits, 11: 1.5 Stop bit
		UART4->CR2 |= ((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 2) < 0.00001) // STOP: STOP bits, 10: 2 Stop bits
		UART4->CR2 |= (1 << 13);
	value = (double) getsysclk() / ( gethpre() * sampling * baudrate );
	fracpart = modf(value, &intpart);
	UART4->BRR = 0; // clean slate, reset.
	if(samplingmode == 16){
		UART4->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		UART4->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else if(samplingmode == 8){
		UART4->BRR = (uint32_t) (round(fracpart * 8)); // DIV_Fraction
		UART4->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else{
		UART4->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		UART4->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0], default.
	}
}
/*** UART 4 Bit Mapping ***/
// SR
uint8_t STM32446Uart4_cts(void)
{
	return readreg(UART4->SR, 1, 9);
}
void STM32446Uart4_clear_cts(void)
{
	setreg(&UART4->SR, 1, 9, 0);
}
uint8_t STM32446Uart4_lbd(void)
{
	return readreg(UART4->SR, 1, 8);
}
void STM32446Uart4_clear_lbd(void)
{
	setreg(&UART4->SR, 1, 8, 0);
}
uint8_t STM32446Uart4_txe(void)
{
	return readreg(UART4->SR, 1, 7);
}
uint8_t STM32446Uart4_tc(void)
{
	return readreg(UART4->SR, 1, 6);
}
void STM32446Uart4_clear_tc(void)
{
	setreg(&UART4->SR, 1, 6, 0);
}
uint8_t STM32446Uart4_rxne(void)
{
	return readreg(UART4->SR, 1, 5);
}
void STM32446Uart4_clear_rxne(void)
{
	setreg(&UART4->SR, 1, 5, 0);
}
uint8_t STM32446Uart4_idle(void)
{
	return readreg(UART4->SR, 1, 4);
}
uint8_t STM32446Uart4_ore(void)
{
	return readreg(UART4->SR, 1, 3);
}
uint8_t STM32446Uart4_nf(void)
{
	return readreg(UART4->SR, 1, 2);
}
uint8_t STM32446Uart4_fe(void)
{
	return readreg(UART4->SR, 1, 1);
}
uint8_t STM32446Uart4_pe(void)
{
	return readreg(UART4->SR, 1, 0);
}
// DR
void STM32446Uart4_dr(uint32_t data)
{
	writereg(&UART4->DR, 9, 0, data);
}
uint32_t STM32446Uart4_get_dr(void)
{
	return readreg(UART4->DR, 9, 0);
}
// BRR
void STM32446Uart4_div_mantissa(uint16_t value)
{
	setreg(&UART4->BRR, 12, 4, value);
}
void STM32446Uart4_div_fraction(uint8_t value)
{
	setreg(&UART4->BRR, 4, 0, value);
}
// CR1
void STM32446Uart4_over8(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 15, bool);
}
void STM32446Uart4_ue(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 13, bool);
}
void STM32446Uart4_m(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 12, bool);
}
void STM32446Uart4_wake(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 11, bool);
}
void STM32446Uart4_pce(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 10, bool);
}
void STM32446Uart4_ps(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 9, bool);
}
void STM32446Uart4_peie(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 8, bool);
}
void STM32446Uart4_txeie(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 7, bool);
}
void STM32446Uart4_tcie(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 6, bool);
}
void STM32446Uart4_rxneie(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 5, bool);
}
void STM32446Uart4_idleie(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 4, bool);
}
void STM32446Uart4_te(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 3, bool);
}
void STM32446Uart4_re(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 2, bool);
}
void STM32446Uart4_rwu(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 1, bool);
}
void STM32446Uart4_sbk(uint8_t bool)
{
	setreg(&UART4->CR1, 1, 0, bool);
}
// CR2
void STM32446Uart4_linen(uint8_t bool)
{
	setreg(&UART4->CR2, 1, 14, bool);
}
void STM32446Uart4_stop(uint8_t value)
{
	setreg(&UART4->CR2, 2, 12, value);
}
void STM32446Uart4_clken(uint8_t bool)
{
	setreg(&UART4->CR2, 1, 11, bool);
}
void STM32446Uart4_cpol(uint8_t bool)
{
	setreg(&UART4->CR2, 1, 10, bool);
}
void STM32446Uart4_cpha(uint8_t bool)
{
	setreg(&UART4->CR2, 1, 9, bool);
}
void STM32446Uart4_lbcl(uint8_t bool)
{
	setreg(&UART4->CR2, 1, 8, bool);
}
void STM32446Uart4_lbdie(uint8_t bool)
{
	setreg(&UART4->CR2, 1, 6, bool);
}
void STM32446Uart4_lbdl(uint8_t bool)
{
	setreg(&UART4->CR2, 1, 5, bool);
}
void STM32446Uart4_add(uint8_t value)
{
	setreg(&UART4->CR2, 4, 0, value);
}
// CR3
void STM32446Uart4_onebit(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 11, bool);
}
void STM32446Uart4_ctsie(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 10, bool);
}
void STM32446Uart4_ctse(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 9, bool);
}
void STM32446Uart4_rtse(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 8, bool);
}
void STM32446Uart4_dmat(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 7, bool);
}
void STM32446Uart4_dmar(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 6, bool);
}
void STM32446Uart4_scen(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 5, bool);
}
void STM32446Uart4_nack(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 4, bool);
}
void STM32446Uart4_hdsel(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 3, bool);
}
void STM32446Uart4_irlp(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 2, bool);
}
void STM32446Uart4_iren(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 1, bool);
}
void STM32446Uart4_eie(uint8_t bool)
{
	setreg(&UART4->CR3, 1, 0, bool);
}
// GTPR
void STM32446Uart4_gt(uint8_t value)
{
	setreg(&UART4->GTPR, 8, 8, value);
}
void STM32446Uart4_psc(uint8_t value)
{
	setreg(&UART4->GTPR, 8, 0, value);
}
/*** UART5 ***/
void STM32446Uart5Clock( uint8_t bool )
{
	if(bool){ RCC->APB1ENR |= (1 << 20); } // UART5EN: USART5 clock enable
	else{ RCC->APB1ENR &= ~(1 << 20); } // UART5EN: USART5 clock disable
}
void STM32446Uart5Parameter( uint8_t wordlength, uint8_t samplingmode, double stopbits, uint32_t baudrate )
// Sets the uart parameters, using real values.
{
	uint8_t sampling;
	double value, fracpart, intpart;
	if(wordlength == 9)
		UART5->CR1 |= (1 << 12); // M: Word length, 1 - 9bit.
	else if(wordlength == 8)
		UART5->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit.
	else
		UART5->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit, default.
	if(samplingmode == 8){
		sampling = 8;
		UART5->CR1 |= (1 << 15); // OVER8: Oversampling mode, 1 - 8.
	}else if(samplingmode == 16){
		sampling = 16;
		UART5->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16.
	}else{
		sampling = 16;
		UART5->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16, default.
	}
	UART5->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12)); // STOP: STOP bits 00 - 1stopbit, default.
	if(fabs(stopbits - 0.5) < 0.00001) // STOP: STOP bits, 01: 0.5 Stop bit
		UART5->CR2 |= (1 << 12);
	else if(fabs(stopbits - 1) < 0.00001) // STOP: STOP bits, 00: 1 Stop bit.
		UART5->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 1.5) < 0.00001) // STOP: STOP bits, 11: 1.5 Stop bit
		UART5->CR2 |= ((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 2) < 0.00001) // STOP: STOP bits, 10: 2 Stop bits
		UART5->CR2 |= (1 << 13);
	value = (double) getsysclk() / ( gethpre() * sampling * baudrate );
	fracpart = modf(value, &intpart);
	UART5->BRR = 0; // clean slate, reset.
	if(samplingmode == 16){
		UART5->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		UART5->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else if(samplingmode == 8){
		UART5->BRR = (uint32_t) (round(fracpart * 8)); // DIV_Fraction
		UART5->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else{
		UART5->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		UART5->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0], default.
	}
}
/*** UART 5 Bit Mapping ***/
// SR
uint8_t STM32446Uart5_cts(void)
{
	return readreg(UART5->SR, 1, 9);
}
void STM32446Uart5_clear_cts(void)
{
	setreg(&UART5->SR, 1, 9, 0);
}
uint8_t STM32446Uart5_lbd(void)
{
	return readreg(UART5->SR, 1, 8);
}
void STM32446Uart5_clear_lbd(void)
{
	setreg(&UART5->SR, 1, 8, 0);
}
uint8_t STM32446Uart5_txe(void)
{
	return readreg(UART5->SR, 1, 7);
}
uint8_t STM32446Uart5_tc(void)
{
	return readreg(UART5->SR, 1, 6);
}
void STM32446Uart5_clear_tc(void)
{
	setreg(&UART5->SR, 1, 6, 0);
}
uint8_t STM32446Uart5_rxne(void)
{
	return readreg(UART5->SR, 1, 5);
}
void STM32446Uart5_clear_rxne(void)
{
	setreg(&UART5->SR, 1, 5, 0);
}
uint8_t STM32446Uart5_idle(void)
{
	return readreg(UART5->SR, 1, 4);
}
uint8_t STM32446Uart5_ore(void)
{
	return readreg(UART5->SR, 1, 3);
}
uint8_t STM32446Uart5_nf(void)
{
	return readreg(UART5->SR, 1, 2);
}
uint8_t STM32446Uart5_fe(void)
{
	return readreg(UART5->SR, 1, 1);
}
uint8_t STM32446Uart5_pe(void)
{
	return readreg(UART5->SR, 1, 0);
}
// DR
void STM32446Uart5_dr(uint32_t data)
{
	writereg(&UART5->DR, 9, 0, data);
}
uint32_t STM32446Uart5_get_dr(void)
{
	return readreg(UART5->DR, 9, 0);
}
// BRR
void STM32446Uart5_div_mantissa(uint16_t value)
{
	setreg(&UART5->BRR, 12, 4, value);
}
void STM32446Uart5_div_fraction(uint8_t value)
{
	setreg(&UART5->BRR, 4, 0, value);
}
// CR1
void STM32446Uart5_over8(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 15, bool);
}
void STM32446Uart5_ue(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 13, bool);
}
void STM32446Uart5_m(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 12, bool);
}
void STM32446Uart5_wake(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 11, bool);
}
void STM32446Uart5_pce(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 10, bool);
}
void STM32446Uart5_ps(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 9, bool);
}
void STM32446Uart5_peie(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 8, bool);
}
void STM32446Uart5_txeie(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 7, bool);
}
void STM32446Uart5_tcie(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 6, bool);
}
void STM32446Uart5_rxneie(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 5, bool);
}
void STM32446Uart5_idleie(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 4, bool);
}
void STM32446Uart5_te(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 3, bool);
}
void STM32446Uart5_re(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 2, bool);
}
void STM32446Uart5_rwu(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 1, bool);
}
void STM32446Uart5_sbk(uint8_t bool)
{
	setreg(&UART5->CR1, 1, 0, bool);
}
// CR2
void STM32446Uart5_linen(uint8_t bool)
{
	setreg(&UART5->CR2, 1, 14, bool);
}
void STM32446Uart5_stop(uint8_t value)
{
	setreg(&UART5->CR2, 2, 12, value);
}
void STM32446Uart5_clken(uint8_t bool)
{
	setreg(&UART5->CR2, 1, 11, bool);
}
void STM32446Uart5_cpol(uint8_t bool)
{
	setreg(&UART5->CR2, 1, 10, bool);
}
void STM32446Uart5_cpha(uint8_t bool)
{
	setreg(&UART5->CR2, 1, 9, bool);
}
void STM32446Uart5_lbcl(uint8_t bool)
{
	setreg(&UART5->CR2, 1, 8, bool);
}
void STM32446Uart5_lbdie(uint8_t bool)
{
	setreg(&UART5->CR2, 1, 6, bool);
}
void STM32446Uart5_lbdl(uint8_t bool)
{
	setreg(&UART5->CR2, 1, 5, bool);
}
void STM32446Uart5_add(uint8_t value)
{
	setreg(&UART5->CR2, 4, 0, value);
}
// CR3
void STM32446Uart5_onebit(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 11, bool);
}
void STM32446Uart5_ctsie(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 10, bool);
}
void STM32446Uart5_ctse(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 9, bool);
}
void STM32446Uart5_rtse(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 8, bool);
}
void STM32446Uart5_dmat(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 7, bool);
}
void STM32446Uart5_dmar(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 6, bool);
}
void STM32446Uart5_scen(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 5, bool);
}
void STM32446Uart5_nack(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 4, bool);
}
void STM32446Uart5_hdsel(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 3, bool);
}
void STM32446Uart5_irlp(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 2, bool);
}
void STM32446Uart5_iren(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 1, bool);
}
void STM32446Uart5_eie(uint8_t bool)
{
	setreg(&UART5->CR3, 1, 0, bool);
}
// GTPR
void STM32446Uart5_gt(uint8_t value)
{
	setreg(&UART5->GTPR, 8, 8, value);
}
void STM32446Uart5_psc(uint8_t value)
{
	setreg(&UART5->GTPR, 8, 0, value);
}
/*** USART6 ***/
void STM32446Usart6Clock( uint8_t bool )
{
	if(bool){ RCC->APB2ENR |= (1 << 5); } // USART6EN: USART6 clock enable
	else{ RCC->APB2ENR &= ~(1 << 5); } // USART6EN: USART6 clock disable
}
void STM32446Usart6Parameter( uint8_t wordlength, uint8_t samplingmode, double stopbits, uint32_t baudrate )
// Sets the usart parameters, using real values.
{
	uint8_t sampling;
	double value, fracpart, intpart;
	if(wordlength == 9)
		USART6->CR1 |= (1 << 12); // M: Word length, 1 - 9bit.
	else if(wordlength == 8)
		USART6->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit.
	else
		USART6->CR1 &= (uint32_t) ~(1 << 12); // M: Word length, 0 - 8bit, default.
	if(samplingmode == 8){
		sampling = 8;
		USART6->CR1 |= (1 << 15); // OVER8: Oversampling mode, 1 - 8.
	}else if(samplingmode == 16){
		sampling = 16;
		USART6->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16.
	}else{
		sampling = 16;
		USART6->CR1 &= (uint32_t) ~(1 << 15); // OVER8: Oversampling mode, 0 - 16, default.
	}
	USART6->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12)); // STOP: STOP bits 00 - 1stopbit, default.
	if(fabs(stopbits - 0.5) < 0.00001) // STOP: STOP bits, 01: 0.5 Stop bit
		USART6->CR2 |= (1 << 12);
	else if(fabs(stopbits - 1) < 0.00001) // STOP: STOP bits, 00: 1 Stop bit.
		USART6->CR2 &= (uint32_t) ~((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 1.5) < 0.00001) // STOP: STOP bits, 11: 1.5 Stop bit
		USART6->CR2 |= ((1 << 13) | (1 << 12));
	else if(fabs(stopbits - 2) < 0.00001) // STOP: STOP bits, 10: 2 Stop bits
		USART6->CR2 |= (1 << 13);
	value = (double) getsysclk() / ( gethpre() * sampling * baudrate );
	fracpart = modf(value, &intpart);
	USART6->BRR = 0; // clean slate, reset.
	if(samplingmode == 16){
		USART6->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART6->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else if(samplingmode == 8){
		USART6->BRR = (uint32_t) (round(fracpart * 8)); // DIV_Fraction
		USART6->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0]
	}else{
		USART6->BRR = (uint32_t) (round(fracpart * 16)); // DIV_Fraction
		USART6->BRR |= ((uint32_t) intpart << 4); // DIV_Mantissa[11:0], default.
	}
}
/*** USART 6 Bit Mapping ***/
// SR
uint8_t STM32446Usart6_cts(void)
{
	return readreg(USART6->SR, 1, 9);
}
void STM32446Usart6_clear_cts(void)
{
	setreg(&USART6->SR, 1, 9, 0);
}
uint8_t STM32446Usart6_lbd(void)
{
	return readreg(USART6->SR, 1, 8);
}
void STM32446Usart6_clear_lbd(void)
{
	setreg(&USART6->SR, 1, 8, 0);
}
uint8_t STM32446Usart6_txe(void)
{
	return readreg(USART6->SR, 1, 7);
}
uint8_t STM32446Usart6_tc(void)
{
	return readreg(USART6->SR, 1, 6);
}
void STM32446Usart6_clear_tc(void)
{
	setreg(&USART6->SR, 1, 6, 0);
}
uint8_t STM32446Usart6_rxne(void)
{
	return readreg(USART6->SR, 1, 5);
}
void STM32446Usart6_clear_rxne(void)
{
	setreg(&USART6->SR, 1, 5, 0);
}
uint8_t STM32446Usart6_idle(void)
{
	return readreg(USART6->SR, 1, 4);
}
uint8_t STM32446Usart6_ore(void)
{
	return readreg(USART6->SR, 1, 3);
}
uint8_t STM32446Usart6_nf(void)
{
	return readreg(USART6->SR, 1, 2);
}
uint8_t STM32446Usart6_fe(void)
{
	return readreg(USART6->SR, 1, 1);
}
uint8_t STM32446Usart6_pe(void)
{
	return readreg(USART6->SR, 1, 0);
}
// DR
void STM32446Usart6_dr(uint32_t data)
{
	writereg(&USART6->DR, 9, 0, data);
}
uint32_t STM32446Usart6_get_dr(void)
{
	return readreg(USART6->DR, 9, 0);
}
// BRR
void STM32446Usart6_div_mantissa(uint16_t value)
{
	setreg(&USART6->BRR, 12, 4, value);
}
void STM32446Usart6_div_fraction(uint8_t value)
{
	setreg(&USART6->BRR, 4, 0, value);
}
// CR1
void STM32446Usart6_over8(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 15, bool);
}
void STM32446Usart6_ue(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 13, bool);
}
void STM32446Usart6_m(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 12, bool);
}
void STM32446Usart6_wake(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 11, bool);
}
void STM32446Usart6_pce(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 10, bool);
}
void STM32446Usart6_ps(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 9, bool);
}
void STM32446Usart6_peie(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 8, bool);
}
void STM32446Usart6_txeie(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 7, bool);
}
void STM32446Usart6_tcie(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 6, bool);
}
void STM32446Usart6_rxneie(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 5, bool);
}
void STM32446Usart6_idleie(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 4, bool);
}
void STM32446Usart6_te(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 3, bool);
}
void STM32446Usart6_re(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 2, bool);
}
void STM32446Usart6_rwu(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 1, bool);
}
void STM32446Usart6_sbk(uint8_t bool)
{
	setreg(&USART6->CR1, 1, 0, bool);
}
// CR2
void STM32446Usart6_linen(uint8_t bool)
{
	setreg(&USART6->CR2, 1, 14, bool);
}
void STM32446Usart6_stop(uint8_t value)
{
	setreg(&USART6->CR2, 2, 12, value);
}
void STM32446Usart6_clken(uint8_t bool)
{
	setreg(&USART6->CR2, 1, 11, bool);
}
void STM32446Usart6_cpol(uint8_t bool)
{
	setreg(&USART6->CR2, 1, 10, bool);
}
void STM32446Usart6_cpha(uint8_t bool)
{
	setreg(&USART6->CR2, 1, 9, bool);
}
void STM32446Usart6_lbcl(uint8_t bool)
{
	setreg(&USART6->CR2, 1, 8, bool);
}
void STM32446Usart6_lbdie(uint8_t bool)
{
	setreg(&USART6->CR2, 1, 6, bool);
}
void STM32446Usart6_lbdl(uint8_t bool)
{
	setreg(&USART6->CR2, 1, 5, bool);
}
void STM32446Usart6_add(uint8_t value)
{
	setreg(&USART6->CR2, 4, 0, value);
}
// CR3
void STM32446Usart6_onebit(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 11, bool);
}
void STM32446Usart6_ctsie(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 10, bool);
}
void STM32446Usart6_ctse(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 9, bool);
}
void STM32446Usart6_rtse(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 8, bool);
}
void STM32446Usart6_dmat(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 7, bool);
}
void STM32446Usart6_dmar(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 6, bool);
}
void STM32446Usart6_scen(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 5, bool);
}
void STM32446Usart6_nack(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 4, bool);
}
void STM32446Usart6_hdsel(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 3, bool);
}
void STM32446Usart6_irlp(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 2, bool);
}
void STM32446Usart6_iren(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 1, bool);
}
void STM32446Usart6_eie(uint8_t bool)
{
	setreg(&USART6->CR3, 1, 0, bool);
}
// GTPR
void STM32446Usart6_gt(uint8_t value)
{
	setreg(&USART6->GTPR, 8, 8, value);
}
void STM32446Usart6_psc(uint8_t value)
{
	setreg(&USART6->GTPR, 8, 0, value);
}
/*** USART1 Auxiliar ***/
STM32446USART_SR* stm32446_usart1_sr_inic(void)
{

	// SR
	stm32446_usart1_sr.cts = STM32446Usart1_cts;
	stm32446_usart1_sr.clear_cts = STM32446Usart1_clear_cts;
	stm32446_usart1_sr.lbd = STM32446Usart1_lbd;
	stm32446_usart1_sr.clear_lbd = STM32446Usart1_clear_lbd;
	stm32446_usart1_sr.txe = STM32446Usart1_txe;
	stm32446_usart1_sr.tc = STM32446Usart1_tc;
	stm32446_usart1_sr.clear_tc = STM32446Usart1_clear_tc;
	stm32446_usart1_sr.rxne = STM32446Usart1_rxne;
	stm32446_usart1_sr.clear_rxne = STM32446Usart1_clear_rxne;
	stm32446_usart1_sr.idle = STM32446Usart1_idle;
	stm32446_usart1_sr.ore = STM32446Usart1_ore;
	stm32446_usart1_sr.nf = STM32446Usart1_nf;
	stm32446_usart1_sr.fe = STM32446Usart1_fe;
	stm32446_usart1_sr.pe = STM32446Usart1_pe;
	return &stm32446_usart1_sr;
}
STM32446USART_BRR* stm32446_usart1_brr_inic(void)
{

	// BRR
	stm32446_usart1_brr.div_mantissa = STM32446Usart1_div_mantissa;
	stm32446_usart1_brr.div_fraction = STM32446Usart1_div_fraction;
	return &stm32446_usart1_brr;
}
STM32446USART_CR1* stm32446_usart1_cr1_inic(void)
{

	// CR1
	stm32446_usart1_cr1.over8 = STM32446Usart1_over8;
	stm32446_usart1_cr1.ue = STM32446Usart1_ue;
	stm32446_usart1_cr1.m = STM32446Usart1_m;
	stm32446_usart1_cr1.wake = STM32446Usart1_wake;
	stm32446_usart1_cr1.pce = STM32446Usart1_pce;
	stm32446_usart1_cr1.ps = STM32446Usart1_ps;
	stm32446_usart1_cr1.peie = STM32446Usart1_peie;
	stm32446_usart1_cr1.txeie = STM32446Usart1_txeie;
	stm32446_usart1_cr1.tcie = STM32446Usart1_tcie;
	stm32446_usart1_cr1.rxneie = STM32446Usart1_rxneie;
	stm32446_usart1_cr1.idleie = STM32446Usart1_idleie;
	stm32446_usart1_cr1.te = STM32446Usart1_te;
	stm32446_usart1_cr1.re = STM32446Usart1_re;
	stm32446_usart1_cr1.rwu = STM32446Usart1_rwu;
	stm32446_usart1_cr1.sbk = STM32446Usart1_sbk;
	return &stm32446_usart1_cr1;
}
STM32446USART_CR2* stm32446_usart1_cr2_inic(void)
{

