BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446usart.c
	// CR2
	stm32446_usart1_cr2.linen = STM32446Usart1_linen;
	stm32446_usart1_cr2.stop = STM32446Usart1_stop;
	stm32446_usart1_cr2.clken = STM32446Usart1_clken;
	stm32446_usart1_cr2.cpol = STM32446Usart1_cpol;
	stm32446_usart1_cr2.cpha = STM32446Usart1_cpha;
	stm32446_usart1_cr2.lbcl = STM32446Usart1_lbcl;
	stm32446_usart1_cr2.lbdie = STM32446Usart1_lbdie;
	stm32446_usart1_cr2.lbdl = STM32446Usart1_lbdl;
	stm32446_usart1_cr2.add = STM32446Usart1_add;
	return &stm32446_usart1_cr2;
}
STM32446USART_CR3* stm32446_usart1_cr3_inic(void)
{

	// CR3
	stm32446_usart1_cr3.onebit = STM32446Usart1_onebit;
	stm32446_usart1_cr3.ctsie = STM32446Usart1_ctsie;
	stm32446_usart1_cr3.ctse = STM32446Usart1_ctse;
	stm32446_usart1_cr3.rtse = STM32446Usart1_rtse;
	stm32446_usart1_cr3.dmat = STM32446Usart1_dmat;
	stm32446_usart1_cr3.dmar = STM32446Usart1_dmar;
	stm32446_usart1_cr3.scen = STM32446Usart1_scen;
	stm32446_usart1_cr3.nack = STM32446Usart1_nack;
	stm32446_usart1_cr3.hdsel = STM32446Usart1_hdsel;
	stm32446_usart1_cr3.irlp = STM32446Usart1_irlp;
	stm32446_usart1_cr3.iren = STM32446Usart1_iren;
	stm32446_usart1_cr3.eie = STM32446Usart1_eie;
	return &stm32446_usart1_cr3;
}
STM32446USART_GTPR* stm32446_usart1_gtpr_inic(void)
{

	// GTPR
	stm32446_usart1_gtpr.gt = STM32446Usart1_gt;
	stm32446_usart1_gtpr.psc = STM32446Usart1_psc;
	return &stm32446_usart1_gtpr;
}
/*** USART1 INIC Procedure & Function Definition ***/
STM32446_USART1 usart1_enable(void)
{

	// STM32446USART1obj stm32446_usart1;
	stm32446_usart1.reg = USART1;
	/*** USART1 Bit Mapping Link ***/
	stm32446_usart1.sr = stm32446_usart1_sr_inic();
	stm32446_usart1.dr = STM32446Usart1_dr;
	stm32446_usart1.get_dr = STM32446Usart1_get_dr;
	stm32446_usart1.brr = stm32446_usart1_brr_inic();
	stm32446_usart1.cr1 = stm32446_usart1_cr1_inic();
	stm32446_usart1.cr2 = stm32446_usart1_cr2_inic();
	stm32446_usart1.cr3 = stm32446_usart1_cr3_inic();
	stm32446_usart1.gtpr = stm32446_usart1_gtpr_inic();
	// Other
	stm32446_usart1.clock = STM32446Usart1Clock;
	stm32446_usart1.parameter = STM32446Usart1Parameter;

	return stm32446_usart1;
}

STM32446_USART1*  usart1(void){ return (STM32446_USART1*) &stm32446_usart1; }

/*** USART2 Auxiliar ***/
STM32446USART_SR* stm32446_usart2_sr_inic(void)
{

	// SR
	stm32446_usart2_sr.cts = STM32446Usart2_cts;
	stm32446_usart2_sr.clear_cts = STM32446Usart2_clear_cts;
	stm32446_usart2_sr.lbd = STM32446Usart2_lbd;
	stm32446_usart2_sr.clear_lbd = STM32446Usart2_clear_lbd;
	stm32446_usart2_sr.txe = STM32446Usart2_txe;
	stm32446_usart2_sr.tc = STM32446Usart2_tc;
	stm32446_usart2_sr.clear_tc = STM32446Usart2_clear_tc;
	stm32446_usart2_sr.rxne = STM32446Usart2_rxne;
	stm32446_usart2_sr.clear_rxne = STM32446Usart2_clear_rxne;
	stm32446_usart2_sr.idle = STM32446Usart2_idle;
	stm32446_usart2_sr.ore = STM32446Usart2_ore;
	stm32446_usart2_sr.nf = STM32446Usart2_nf;
	stm32446_usart2_sr.fe = STM32446Usart2_fe;
	stm32446_usart2_sr.pe = STM32446Usart2_pe;
	return &stm32446_usart2_sr;
}
STM32446USART_BRR* stm32446_usart2_brr_inic(void)
{

	// BRR
	stm32446_usart2_brr.div_mantissa = STM32446Usart2_div_mantissa;
	stm32446_usart2_brr.div_fraction = STM32446Usart2_div_fraction;
	return &stm32446_usart2_brr;
}
STM32446USART_CR1* stm32446_usart2_cr1_inic(void)
{

	// CR1
	stm32446_usart2_cr1.over8 = STM32446Usart2_over8;
	stm32446_usart2_cr1.ue = STM32446Usart2_ue;
	stm32446_usart2_cr1.m = STM32446Usart2_m;
	stm32446_usart2_cr1.wake = STM32446Usart2_wake;
	stm32446_usart2_cr1.pce = STM32446Usart2_pce;
	stm32446_usart2_cr1.ps = STM32446Usart2_ps;
	stm32446_usart2_cr1.peie = STM32446Usart2_peie;
	stm32446_usart2_cr1.txeie = STM32446Usart2_txeie;
	stm32446_usart2_cr1.tcie = STM32446Usart2_tcie;
	stm32446_usart2_cr1.rxneie = STM32446Usart2_rxneie;
	stm32446_usart2_cr1.idleie = STM32446Usart2_idleie;
	stm32446_usart2_cr1.te = STM32446Usart2_te;
	stm32446_usart2_cr1.re = STM32446Usart2_re;
	stm32446_usart2_cr1.rwu = STM32446Usart2_rwu;
	stm32446_usart2_cr1.sbk = STM32446Usart2_sbk;
	return &stm32446_usart2_cr1;
}
STM32446USART_CR2* stm32446_usart2_cr2_inic(void)
{

	// CR2
	stm32446_usart2_cr2.linen = STM32446Usart2_linen;
	stm32446_usart2_cr2.stop = STM32446Usart2_stop;
	stm32446_usart2_cr2.clken = STM32446Usart2_clken;
	stm32446_usart2_cr2.cpol = STM32446Usart2_cpol;
	stm32446_usart2_cr2.cpha = STM32446Usart2_cpha;
	stm32446_usart2_cr2.lbcl = STM32446Usart2_lbcl;
	stm32446_usart2_cr2.lbdie = STM32446Usart2_lbdie;
	stm32446_usart2_cr2.lbdl = STM32446Usart2_lbdl;
	stm32446_usart2_cr2.add = STM32446Usart2_add;
	return &stm32446_usart2_cr2;
}
STM32446USART_CR3* stm32446_usart2_cr3_inic(void)
{

	// CR3
	stm32446_usart2_cr3.onebit = STM32446Usart2_onebit;
	stm32446_usart2_cr3.ctsie = STM32446Usart2_ctsie;
	stm32446_usart2_cr3.ctse = STM32446Usart2_ctse;
	stm32446_usart2_cr3.rtse = STM32446Usart2_rtse;
	stm32446_usart2_cr3.dmat = STM32446Usart2_dmat;
	stm32446_usart2_cr3.dmar = STM32446Usart2_dmar;
	stm32446_usart2_cr3.scen = STM32446Usart2_scen;
	stm32446_usart2_cr3.nack = STM32446Usart2_nack;
	stm32446_usart2_cr3.hdsel = STM32446Usart2_hdsel;
	stm32446_usart2_cr3.irlp = STM32446Usart2_irlp;
	stm32446_usart2_cr3.iren = STM32446Usart2_iren;
	stm32446_usart2_cr3.eie = STM32446Usart2_eie;
	return &stm32446_usart2_cr3;
}
STM32446USART_GTPR* stm32446_usart2_gtpr_inic(void)
{

	// GTPR
	stm32446_usart2_gtpr.gt = STM32446Usart2_gt;
	stm32446_usart2_gtpr.psc = STM32446Usart2_psc;
	return &stm32446_usart2_gtpr;
}
/*** USART2 INIC Procedure & Function Definition ***/
STM32446_USART2 usart2_enable(void)
{

	stm32446_usart2.reg = USART2;
	/*** USART2 Bit Mapping Link ***/
	stm32446_usart2.sr = stm32446_usart2_sr_inic();
	stm32446_usart2.dr = STM32446Usart2_dr;
	stm32446_usart2.get_dr = STM32446Usart2_get_dr;
	stm32446_usart2.brr = stm32446_usart2_brr_inic();
	stm32446_usart2.cr1 = stm32446_usart2_cr1_inic();
	stm32446_usart2.cr2 = stm32446_usart2_cr2_inic();
	stm32446_usart2.cr3 = stm32446_usart2_cr3_inic();
	stm32446_usart2.gtpr = stm32446_usart2_gtpr_inic();
	// Other
	stm32446_usart2.clock = STM32446Usart2Clock;
	stm32446_usart2.parameter = STM32446Usart2Parameter;
	return stm32446_usart2;
}

STM32446_USART2*  usart2(void){ return (STM32446_USART2*) &stm32446_usart2; }

