BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446usart.c
/*** USART3 Auxiliar ***/
STM32446USART_SR* stm32446_usart3_sr_inic(void)
{

	// SR
	stm32446_usart3_sr.cts = STM32446Usart3_cts;
	stm32446_usart3_sr.clear_cts = STM32446Usart3_clear_cts;
	stm32446_usart3_sr.lbd = STM32446Usart3_lbd;
	stm32446_usart3_sr.clear_lbd = STM32446Usart3_clear_lbd;
	stm32446_usart3_sr.txe = STM32446Usart3_txe;
	stm32446_usart3_sr.tc = STM32446Usart3_tc;
	stm32446_usart3_sr.clear_tc = STM32446Usart3_clear_tc;
	stm32446_usart3_sr.rxne = STM32446Usart3_rxne;
	stm32446_usart3_sr.clear_rxne = STM32446Usart3_clear_rxne;
	stm32446_usart3_sr.idle = STM32446Usart3_idle;
	stm32446_usart3_sr.ore = STM32446Usart3_ore;
	stm32446_usart3_sr.nf = STM32446Usart3_nf;
	stm32446_usart3_sr.fe = STM32446Usart3_fe;
	stm32446_usart3_sr.pe = STM32446Usart3_pe;
	return &stm32446_usart3_sr;
}
STM32446USART_BRR* stm32446_usart3_brr_inic(void)
{

	// BRR
	stm32446_usart3_brr.div_mantissa = STM32446Usart3_div_mantissa;
	stm32446_usart3_brr.div_fraction = STM32446Usart3_div_fraction;
	return &stm32446_usart3_brr;
}
STM32446USART_CR1* stm32446_usart3_cr1_inic(void)
{

	// CR1
	stm32446_usart3_cr1.over8 = STM32446Usart3_over8;
	stm32446_usart3_cr1.ue = STM32446Usart3_ue;
	stm32446_usart3_cr1.m = STM32446Usart3_m;
	stm32446_usart3_cr1.wake = STM32446Usart3_wake;
	stm32446_usart3_cr1.pce = STM32446Usart3_pce;
	stm32446_usart3_cr1.ps = STM32446Usart3_ps;
	stm32446_usart3_cr1.peie = STM32446Usart3_peie;
	stm32446_usart3_cr1.txeie = STM32446Usart3_txeie;
	stm32446_usart3_cr1.tcie = STM32446Usart3_tcie;
	stm32446_usart3_cr1.rxneie = STM32446Usart3_rxneie;
	stm32446_usart3_cr1.idleie = STM32446Usart3_idleie;
	stm32446_usart3_cr1.te = STM32446Usart3_te;
	stm32446_usart3_cr1.re = STM32446Usart3_re;
	stm32446_usart3_cr1.rwu = STM32446Usart3_rwu;
	stm32446_usart3_cr1.sbk = STM32446Usart3_sbk;
	return &stm32446_usart3_cr1;
}
STM32446USART_CR2* stm32446_usart3_cr2_inic(void)
{

	// CR2
	stm32446_usart3_cr2.linen = STM32446Usart3_linen;
	stm32446_usart3_cr2.stop = STM32446Usart3_stop;
	stm32446_usart3_cr2.clken = STM32446Usart3_clken;
	stm32446_usart3_cr2.cpol = STM32446Usart3_cpol;
	stm32446_usart3_cr2.cpha = STM32446Usart3_cpha;
	stm32446_usart3_cr2.lbcl = STM32446Usart3_lbcl;
	stm32446_usart3_cr2.lbdie = STM32446Usart3_lbdie;
	stm32446_usart3_cr2.lbdl = STM32446Usart3_lbdl;
	stm32446_usart3_cr2.add = STM32446Usart3_add;
	return &stm32446_usart3_cr2;
}
STM32446USART_CR3* stm32446_usart3_cr3_inic(void)
{

	// CR3
	stm32446_usart3_cr3.onebit = STM32446Usart3_onebit;
	stm32446_usart3_cr3.ctsie = STM32446Usart3_ctsie;
	stm32446_usart3_cr3.ctse = STM32446Usart3_ctse;
	stm32446_usart3_cr3.rtse = STM32446Usart3_rtse;
	stm32446_usart3_cr3.dmat = STM32446Usart3_dmat;
	stm32446_usart3_cr3.dmar = STM32446Usart3_dmar;
	stm32446_usart3_cr3.scen = STM32446Usart3_scen;
	stm32446_usart3_cr3.nack = STM32446Usart3_nack;
	stm32446_usart3_cr3.hdsel = STM32446Usart3_hdsel;
	stm32446_usart3_cr3.irlp = STM32446Usart3_irlp;
	stm32446_usart3_cr3.iren = STM32446Usart3_iren;
	stm32446_usart3_cr3.eie = STM32446Usart3_eie;
	return &stm32446_usart3_cr3;
}
STM32446USART_GTPR* stm32446_usart3_gtpr_inic(void)
{

	// GTPR
	stm32446_usart3_gtpr.gt = STM32446Usart3_gt;
	stm32446_usart3_gtpr.psc = STM32446Usart3_psc;
	return &stm32446_usart3_gtpr;
}
/*** USART3 INIC Procedure & Function Definition ***/
STM32446_USART3 usart3_enable(void)
{

	stm32446_usart3.reg = USART3;
	/*** USART3 Bit Mapping Link ***/
	stm32446_usart3.sr = stm32446_usart3_sr_inic();
	stm32446_usart3.dr = STM32446Usart3_dr;
	stm32446_usart3.get_dr = STM32446Usart3_get_dr;
	stm32446_usart3.brr = stm32446_usart3_brr_inic();
	stm32446_usart3.cr1 = stm32446_usart3_cr1_inic();
	stm32446_usart3.cr2 = stm32446_usart3_cr2_inic();
	stm32446_usart3.cr3 = stm32446_usart3_cr3_inic();
	stm32446_usart3.gtpr = stm32446_usart3_gtpr_inic();
	// Other
	stm32446_usart3.clock = STM32446Usart3Clock;
	stm32446_usart3.parameter = STM32446Usart3Parameter;
	return stm32446_usart3;
}

STM32446_USART3*  usart3(void){ return (STM32446_USART3*) &stm32446_usart3; }

/*** UART4 Auxiliar ***/
STM32446USART_SR* stm32446_uart4_sr_inic(void)
{

	// SR
	stm32446_uart4_sr.cts = STM32446Uart4_cts;
	stm32446_uart4_sr.clear_cts = STM32446Uart4_clear_cts;
	stm32446_uart4_sr.lbd = STM32446Uart4_lbd;
	stm32446_uart4_sr.clear_lbd = STM32446Uart4_clear_lbd;
	stm32446_uart4_sr.txe = STM32446Uart4_txe;
	stm32446_uart4_sr.tc = STM32446Uart4_tc;
	stm32446_uart4_sr.clear_tc = STM32446Uart4_clear_tc;
	stm32446_uart4_sr.rxne = STM32446Uart4_rxne;
	stm32446_uart4_sr.clear_rxne = STM32446Uart4_clear_rxne;
	stm32446_uart4_sr.idle = STM32446Uart4_idle;
	stm32446_uart4_sr.ore = STM32446Uart4_ore;
	stm32446_uart4_sr.nf = STM32446Uart4_nf;
	stm32446_uart4_sr.fe = STM32446Uart4_fe;
	stm32446_uart4_sr.pe = STM32446Uart4_pe;
	return &stm32446_uart4_sr;
}
STM32446USART_BRR* stm32446_uart4_brr_inic(void)
{

	// BRR
	stm32446_uart4_brr.div_mantissa = STM32446Uart4_div_mantissa;
	stm32446_uart4_brr.div_fraction = STM32446Uart4_div_fraction;
	return &stm32446_uart4_brr;
}
STM32446USART_CR1* stm32446_uart4_cr1_inic(void)
{

	// CR1
	stm32446_uart4_cr1.over8 = STM32446Uart4_over8;
	stm32446_uart4_cr1.ue = STM32446Uart4_ue;
	stm32446_uart4_cr1.m = STM32446Uart4_m;
	stm32446_uart4_cr1.wake = STM32446Uart4_wake;
	stm32446_uart4_cr1.pce = STM32446Uart4_pce;
	stm32446_uart4_cr1.ps = STM32446Uart4_ps;
	stm32446_uart4_cr1.peie = STM32446Uart4_peie;
	stm32446_uart4_cr1.txeie = STM32446Uart4_txeie;
	stm32446_uart4_cr1.tcie = STM32446Uart4_tcie;
	stm32446_uart4_cr1.rxneie = STM32446Uart4_rxneie;
	stm32446_uart4_cr1.idleie = STM32446Uart4_idleie;
	stm32446_uart4_cr1.te = STM32446Uart4_te;
	stm32446_uart4_cr1.re = STM32446Uart4_re;
	stm32446_uart4_cr1.rwu = STM32446Uart4_rwu;
	stm32446_uart4_cr1.sbk = STM32446Uart4_sbk;
	return &stm32446_uart4_cr1;
}
STM32446USART_CR2* stm32446_uart4_cr2_inic(void)
{

	// CR2
	stm32446_uart4_cr2.linen = STM32446Uart4_linen;
	stm32446_uart4_cr2.stop = STM32446Uart4_stop;
	stm32446_uart4_cr2.clken = STM32446Uart4_clken;
	stm32446_uart4_cr2.cpol = STM32446Uart4_cpol;
	stm32446_uart4_cr2.cpha = STM32446Uart4_cpha;
	stm32446_uart4_cr2.lbcl = STM32446Uart4_lbcl;
	stm32446_uart4_cr2.lbdie = STM32446Uart4_lbdie;
	stm32446_uart4_cr2.lbdl = STM32446Uart4_lbdl;
	stm32446_uart4_cr2.add = STM32446Uart4_add;
	return &stm32446_uart4_cr2;
}
STM32446USART_CR3* stm32446_uart4_cr3_inic(void)
{

	// CR3
	stm32446_uart4_cr3.onebit = STM32446Uart4_onebit;
	stm32446_uart4_cr3.ctsie = STM32446Uart4_ctsie;
	stm32446_uart4_cr3.ctse = STM32446Uart4_ctse;
	stm32446_uart4_cr3.rtse = STM32446Uart4_rtse;
	stm32446_uart4_cr3.dmat = STM32446Uart4_dmat;
	stm32446_uart4_cr3.dmar = STM32446Uart4_dmar;
	stm32446_uart4_cr3.scen = STM32446Uart4_scen;
	stm32446_uart4_cr3.nack = STM32446Uart4_nack;
	stm32446_uart4_cr3.hdsel = STM32446Uart4_hdsel;
	stm32446_uart4_cr3.irlp = STM32446Uart4_irlp;
	stm32446_uart4_cr3.iren = STM32446Uart4_iren;
	stm32446_uart4_cr3.eie = STM32446Uart4_eie;
	return &stm32446_uart4_cr3;
}
STM32446USART_GTPR* stm32446_uart4_gtpr_inic(void)
{

