BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446usart.c
	// GTPR
	stm32446_uart4_gtpr.gt = STM32446Uart4_gt;
	stm32446_uart4_gtpr.psc = STM32446Uart4_psc;
	return &stm32446_uart4_gtpr;
}
/*** UART4 INIC Procedure & Function Definition ***/
STM32446_UART4 uart4_enable(void)
{

	stm32446_uart4.reg = UART4;
	/*** UART4 Bit Mapping Link ***/
	stm32446_uart4.sr = stm32446_uart4_sr_inic();
	stm32446_uart4.dr = STM32446Uart4_dr;
	stm32446_uart4.get_dr = STM32446Uart4_get_dr;
	stm32446_uart4.brr = stm32446_uart4_brr_inic();
	stm32446_uart4.cr1 = stm32446_uart4_cr1_inic();
	stm32446_uart4.cr2 = stm32446_uart4_cr2_inic();
	stm32446_uart4.cr3 = stm32446_uart4_cr3_inic();
	stm32446_uart4.gtpr = stm32446_uart4_gtpr_inic();
	// Other
	stm32446_uart4.clock = STM32446Uart4Clock;
	stm32446_uart4.parameter = STM32446Uart4Parameter;
	return stm32446_uart4;
}

STM32446_UART4*  uart4(void){ return (STM32446_UART4*) &stm32446_uart4; }

/*** UART5 Auxiliar ***/
STM32446USART_SR* stm32446_uart5_sr_inic(void)
{

	// SR
	stm32446_uart5_sr.cts = STM32446Uart5_cts;
	stm32446_uart5_sr.clear_cts = STM32446Uart5_clear_cts;
	stm32446_uart5_sr.lbd = STM32446Uart5_lbd;
	stm32446_uart5_sr.clear_lbd = STM32446Uart5_clear_lbd;
	stm32446_uart5_sr.txe = STM32446Uart5_txe;
	stm32446_uart5_sr.tc = STM32446Uart5_tc;
	stm32446_uart5_sr.clear_tc = STM32446Uart5_clear_tc;
	stm32446_uart5_sr.rxne = STM32446Uart5_rxne;
	stm32446_uart5_sr.clear_rxne = STM32446Uart5_clear_rxne;
	stm32446_uart5_sr.idle = STM32446Uart5_idle;
	stm32446_uart5_sr.ore = STM32446Uart5_ore;
	stm32446_uart5_sr.nf = STM32446Uart5_nf;
	stm32446_uart5_sr.fe = STM32446Uart5_fe;
	stm32446_uart5_sr.pe = STM32446Uart5_pe;
	return &stm32446_uart5_sr;
}
STM32446USART_BRR* stm32446_uart5_brr_inic(void)
{

	// BRR
	stm32446_uart5_brr.div_mantissa = STM32446Uart5_div_mantissa;
	stm32446_uart5_brr.div_fraction = STM32446Uart5_div_fraction;
	return &stm32446_uart5_brr;
}
STM32446USART_CR1* stm32446_uart5_cr1_inic(void)
{

	// CR1
	stm32446_uart5_cr1.over8 = STM32446Uart5_over8;
	stm32446_uart5_cr1.ue = STM32446Uart5_ue;
	stm32446_uart5_cr1.m = STM32446Uart5_m;
	stm32446_uart5_cr1.wake = STM32446Uart5_wake;
	stm32446_uart5_cr1.pce = STM32446Uart5_pce;
	stm32446_uart5_cr1.ps = STM32446Uart5_ps;
	stm32446_uart5_cr1.peie = STM32446Uart5_peie;
	stm32446_uart5_cr1.txeie = STM32446Uart5_txeie;
	stm32446_uart5_cr1.tcie = STM32446Uart5_tcie;
	stm32446_uart5_cr1.rxneie = STM32446Uart5_rxneie;
	stm32446_uart5_cr1.idleie = STM32446Uart5_idleie;
	stm32446_uart5_cr1.te = STM32446Uart5_te;
	stm32446_uart5_cr1.re = STM32446Uart5_re;
	stm32446_uart5_cr1.rwu = STM32446Uart5_rwu;
	stm32446_uart5_cr1.sbk = STM32446Uart5_sbk;
	return &stm32446_uart5_cr1;
}
STM32446USART_CR2* stm32446_uart5_cr2_inic(void)
{

	// CR2
	stm32446_uart5_cr2.linen = STM32446Uart5_linen;
	stm32446_uart5_cr2.stop = STM32446Uart5_stop;
	stm32446_uart5_cr2.clken = STM32446Uart5_clken;
	stm32446_uart5_cr2.cpol = STM32446Uart5_cpol;
	stm32446_uart5_cr2.cpha = STM32446Uart5_cpha;
	stm32446_uart5_cr2.lbcl = STM32446Uart5_lbcl;
	stm32446_uart5_cr2.lbdie = STM32446Uart5_lbdie;
	stm32446_uart5_cr2.lbdl = STM32446Uart5_lbdl;
	stm32446_uart5_cr2.add = STM32446Uart5_add;
	return &stm32446_uart5_cr2;
}
STM32446USART_CR3* stm32446_uart5_cr3_inic(void)
{

	// CR3
	stm32446_uart5_cr3.onebit = STM32446Uart5_onebit;
	stm32446_uart5_cr3.ctsie = STM32446Uart5_ctsie;
	stm32446_uart5_cr3.ctse = STM32446Uart5_ctse;
	stm32446_uart5_cr3.rtse = STM32446Uart5_rtse;
	stm32446_uart5_cr3.dmat = STM32446Uart5_dmat;
	stm32446_uart5_cr3.dmar = STM32446Uart5_dmar;
	stm32446_uart5_cr3.scen = STM32446Uart5_scen;
	stm32446_uart5_cr3.nack = STM32446Uart5_nack;
	stm32446_uart5_cr3.hdsel = STM32446Uart5_hdsel;
	stm32446_uart5_cr3.irlp = STM32446Uart5_irlp;
	stm32446_uart5_cr3.iren = STM32446Uart5_iren;
	stm32446_uart5_cr3.eie = STM32446Uart5_eie;
	return &stm32446_uart5_cr3;
}
STM32446USART_GTPR* stm32446_uart5_gtpr_inic(void)
{

	// GTPR
	stm32446_uart5_gtpr.gt = STM32446Uart5_gt;
	stm32446_uart5_gtpr.psc = STM32446Uart5_psc;
	return &stm32446_uart5_gtpr;
}
/*** UART5 INIC Procedure & Function Definition ***/
STM32446_UART5 uart5_enable(void)
{

	stm32446_uart5.reg = UART5;
	/*** UART5 Bit Mapping Link ***/
	stm32446_uart5.sr = stm32446_uart5_sr_inic();
	stm32446_uart5.dr = STM32446Uart5_dr;
	stm32446_uart5.get_dr = STM32446Uart5_get_dr;
	stm32446_uart5.brr = stm32446_uart5_brr_inic();
	stm32446_uart5.cr1 = stm32446_uart5_cr1_inic();
	stm32446_uart5.cr2 = stm32446_uart5_cr2_inic();
	stm32446_uart5.cr3 = stm32446_uart5_cr3_inic();
	stm32446_uart5.gtpr = stm32446_uart5_gtpr_inic();
	// Other
	stm32446_uart5.clock = STM32446Uart5Clock;
	stm32446_uart5.parameter = STM32446Uart5Parameter;
	return stm32446_uart5;
}

STM32446_UART5*  uart5(void){ return (STM32446_UART5*) &stm32446_uart5; }

/*** USART6 Auxiliar ***/
STM32446USART_SR* stm32446_usart6_sr_inic(void)
{

	// SR
	stm32446_usart6_sr.cts = STM32446Usart6_cts;
	stm32446_usart6_sr.clear_cts = STM32446Usart6_clear_cts;
	stm32446_usart6_sr.lbd = STM32446Usart6_lbd;
	stm32446_usart6_sr.clear_lbd = STM32446Usart6_clear_lbd;
	stm32446_usart6_sr.txe = STM32446Usart6_txe;
	stm32446_usart6_sr.tc = STM32446Usart6_tc;
	stm32446_usart6_sr.clear_tc = STM32446Usart6_clear_tc;
	stm32446_usart6_sr.rxne = STM32446Usart6_rxne;
	stm32446_usart6_sr.clear_rxne = STM32446Usart6_clear_rxne;
	stm32446_usart6_sr.idle = STM32446Usart6_idle;
	stm32446_usart6_sr.ore = STM32446Usart6_ore;
	stm32446_usart6_sr.nf = STM32446Usart6_nf;
	stm32446_usart6_sr.fe = STM32446Usart6_fe;
	stm32446_usart6_sr.pe = STM32446Usart6_pe;
	return &stm32446_usart6_sr;
}
STM32446USART_BRR* stm32446_usart6_brr_inic(void)
{

	// BRR
	stm32446_usart6_brr.div_mantissa = STM32446Usart6_div_mantissa;
	stm32446_usart6_brr.div_fraction = STM32446Usart6_div_fraction;
	return &stm32446_usart6_brr;
}
STM32446USART_CR1* stm32446_usart6_cr1_inic(void)
{

	// CR1
	stm32446_usart6_cr1.over8 = STM32446Usart6_over8;
	stm32446_usart6_cr1.ue = STM32446Usart6_ue;
	stm32446_usart6_cr1.m = STM32446Usart6_m;
	stm32446_usart6_cr1.wake = STM32446Usart6_wake;
	stm32446_usart6_cr1.pce = STM32446Usart6_pce;
	stm32446_usart6_cr1.ps = STM32446Usart6_ps;
	stm32446_usart6_cr1.peie = STM32446Usart6_peie;
	stm32446_usart6_cr1.txeie = STM32446Usart6_txeie;
	stm32446_usart6_cr1.tcie = STM32446Usart6_tcie;
	stm32446_usart6_cr1.rxneie = STM32446Usart6_rxneie;
	stm32446_usart6_cr1.idleie = STM32446Usart6_idleie;
	stm32446_usart6_cr1.te = STM32446Usart6_te;
	stm32446_usart6_cr1.re = STM32446Usart6_re;
	stm32446_usart6_cr1.rwu = STM32446Usart6_rwu;
	stm32446_usart6_cr1.sbk = STM32446Usart6_sbk;
	return &stm32446_usart6_cr1;
}
STM32446USART_CR2* stm32446_usart6_cr2_inic(void)
{

