BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446usart.c
	// CR2
	stm32446_usart6_cr2.linen = STM32446Usart6_linen;
	stm32446_usart6_cr2.stop = STM32446Usart6_stop;
	stm32446_usart6_cr2.clken = STM32446Usart6_clken;
	stm32446_usart6_cr2.cpol = STM32446Usart6_cpol;
	stm32446_usart6_cr2.cpha = STM32446Usart6_cpha;
	stm32446_usart6_cr2.lbcl = STM32446Usart6_lbcl;
	stm32446_usart6_cr2.lbdie = STM32446Usart6_lbdie;
	stm32446_usart6_cr2.lbdl = STM32446Usart6_lbdl;
	stm32446_usart6_cr2.add = STM32446Usart6_add;
	return &stm32446_usart6_cr2;
}
STM32446USART_CR3* stm32446_usart6_cr3_inic(void)
{

	// CR3
	stm32446_usart6_cr3.onebit = STM32446Usart6_onebit;
	stm32446_usart6_cr3.ctsie = STM32446Usart6_ctsie;
	stm32446_usart6_cr3.ctse = STM32446Usart6_ctse;
	stm32446_usart6_cr3.rtse = STM32446Usart6_rtse;
	stm32446_usart6_cr3.dmat = STM32446Usart6_dmat;
	stm32446_usart6_cr3.dmar = STM32446Usart6_dmar;
	stm32446_usart6_cr3.scen = STM32446Usart6_scen;
	stm32446_usart6_cr3.nack = STM32446Usart6_nack;
	stm32446_usart6_cr3.hdsel = STM32446Usart6_hdsel;
	stm32446_usart6_cr3.irlp = STM32446Usart6_irlp;
	stm32446_usart6_cr3.iren = STM32446Usart6_iren;
	stm32446_usart6_cr3.eie = STM32446Usart6_eie;
	return &stm32446_usart6_cr3;
}
STM32446USART_GTPR* stm32446_usart6_gtpr_inic(void)
{

	// GTPR
	stm32446_usart6_gtpr.gt = STM32446Usart6_gt;
	stm32446_usart6_gtpr.psc = STM32446Usart6_psc;
	return &stm32446_usart6_gtpr;
}
/*** USART6 INIC Procedure & Function Definition ***/
STM32446_USART6 usart6_enable(void)
{

	stm32446_usart6.reg = USART6;
	/*** USART6 Bit Mapping Link ***/
	stm32446_usart6.sr = stm32446_usart6_sr_inic();
	stm32446_usart6.dr = STM32446Usart6_dr;
	stm32446_usart6.get_dr = STM32446Usart6_get_dr;
	stm32446_usart6.brr = stm32446_usart6_brr_inic();
	stm32446_usart6.cr1 = stm32446_usart6_cr1_inic();
	stm32446_usart6.cr2 = stm32446_usart6_cr2_inic();
	stm32446_usart6.cr3 = stm32446_usart6_cr3_inic();
	stm32446_usart6.gtpr = stm32446_usart6_gtpr_inic();
	// Other
	stm32446_usart6.clock = STM32446Usart6Clock;
	stm32446_usart6.parameter = STM32446Usart6Parameter;
	return stm32446_usart6;
}

STM32446_USART6*  usart6(void){ return (STM32446_USART6*) &stm32446_usart6; }

/*** EOF ***/

